---
kind: method
id: M:Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.GetEdgeReference1
source: html/cae57017-b1b2-8bfa-02df-3b3d3c9622bc.htm
---
# Autodesk.Revit.DB.PointOnEdgeEdgeIntersection.GetEdgeReference1 Method

Get a copy of the first edge or curve reference.

## Syntax (C#)
```csharp
public Reference GetEdgeReference1()
```